# SphericalLightDistribution Class

---
This class encapsulates a spherical light distribution.
SystemObject Autodesk.Revit.DB.LightingLightDistribution Autodesk.Revit.DB.LightingSphericalLightDistribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SphericalLightDistribution : LightDistribution

    Public Class SphericalLightDistribution
    	Inherits LightDistribution

    public ref class SphericalLightDistribution : public LightDistribution

    type SphericalLightDistribution =
        class
            inherit LightDistribution
        end
The SphericalLightDistribution type exposes the following members.
| Name| Description
---|---|---
| SphericalLightDistribution|  Creates a spherical light distribution object.
| SphericalLightDistribution(SphericalLightDistribution)|  Creates a copy of the given spherical light distribution
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightDistribution)
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightDistribution derived object. (Inherited from LightDistribution)
| Dispose| (Inherited from LightDistribution)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace